---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTableIterator.IsDone
source: html/4d350e2f-8bdd-10aa-3139-18c9da18d84a.htm
---
# Autodesk.Revit.DB.ExportPatternTableIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.